Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxPort_reg.h
/** \brief FC, Port 23 Access Enable Register 0 */
#define P23_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B7FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P24
 * \{  */
/** \brief 0, Port 24 Output Register */
#define P24_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003B800u)

/** \brief 4, Port 24 Output Modification Register */
#define P24_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003B804u)

/** \brief 8, Port 24 Identification Register */
#define P24_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003B808u)

/** \brief 10, Port 24 Input/Output Control Register 0 */
#define P24_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003B810u)

/** \brief 14, Port 24 Input/Output Control Register 4 */
#define P24_IOCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR4*)0xF003B814u)

/** \brief 18, Port 24 Input/Output Control Register 8 */
#define P24_IOCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR8*)0xF003B818u)

/** \brief 1C, Port 24 Input/Output Control Register 12 */
#define P24_IOCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR12*)0xF003B81Cu)

/** \brief 24, Port 24 Input Register */
#define P24_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003B824u)

/** \brief 40, Port 24 Pad Driver Mode Register 0 */
#define P24_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003B840u)

/** \brief 44, Port 24 Pad Driver Mode Register 1 */
#define P24_PDR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR1*)0xF003B844u)

/** \brief 50, Port 24 Emergency Stop Register */
#define P24_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003B850u)

/** \brief 60, Port 24 Pin Function Decision Control Register */
#define P24_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003B860u)

/** \brief 64, Port 24 Pin Controller Select Register */
#define P24_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003B864u)

/** \brief 70, Port 24 Output Modification Set Register 0 */
#define P24_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003B870u)

/** \brief 74, Port 24 Output Modification Set Register 4 */
#define P24_OMSR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR4*)0xF003B874u)

/** \brief 78, Port 24 Output Modification Set Register 8 */
#define P24_OMSR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR8*)0xF003B878u)

/** \brief 7C, Port 24 Output Modification Set Register 12 */
#define P24_OMSR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR12*)0xF003B87Cu)

/** \brief 80, Port 24 Output Modification Clear Register 0 */
#define P24_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003B880u)

/** \brief 84, Port 24 Output Modification Clear Register 4 */
#define P24_OMCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR4*)0xF003B884u)

/** \brief 88, Port 24 Output Modification Clear Register 8 */
#define P24_OMCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR8*)0xF003B888u)

/** \brief 8C, Port 24 Output Modification Clear Register 12 */
#define P24_OMCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR12*)0xF003B88Cu)

/** \brief 90, Port 24 Output Modification Set Register */
#define P24_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003B890u)

/** \brief 94, Port 24 Output Modification Clear Register */
#define P24_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003B894u)

/** \brief F8, Port 24 Access Enable Register 1 */
#define P24_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B8F8u)

/** \brief FC, Port 24 Access Enable Register 0 */
#define P24_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B8FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P25
 * \{  */
/** \brief 0, Port 25 Output Register */
#define P25_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003B900u)

/** \brief 4, Port 25 Output Modification Register */
#define P25_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003B904u)

/** \brief 8, Port 25 Identification Register */
#define P25_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003B908u)

/** \brief 10, Port 25 Input/Output Control Register 0 */
#define P25_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003B910u)

/** \brief 14, Port 25 Input/Output Control Register 4 */
#define P25_IOCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR4*)0xF003B914u)

/** \brief 18, Port 25 Input/Output Control Register 8 */
#define P25_IOCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR8*)0xF003B918u)

/** \brief 1C, Port 25 Input/Output Control Register 12 */
#define P25_IOCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR12*)0xF003B91Cu)

/** \brief 24, Port 25 Input Register */
#define P25_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003B924u)

/** \brief 40, Port 25 Pad Driver Mode Register 0 */
#define P25_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003B940u)

/** \brief 44, Port 25 Pad Driver Mode Register 1 */
#define P25_PDR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR1*)0xF003B944u)

/** \brief 50, Port 25 Emergency Stop Register */
#define P25_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003B950u)

/** \brief 60, Port 25 Pin Function Decision Control Register */
#define P25_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003B960u)

/** \brief 64, Port 25 Pin Controller Select Register */
#define P25_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003B964u)

/** \brief 70, Port 25 Output Modification Set Register 0 */
#define P25_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003B970u)

/** \brief 74, Port 25 Output Modification Set Register 4 */
#define P25_OMSR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR4*)0xF003B974u)

/** \brief 78, Port 25 Output Modification Set Register 8 */
#define P25_OMSR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR8*)0xF003B978u)

/** \brief 7C, Port 25 Output Modification Set Register 12 */
#define P25_OMSR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR12*)0xF003B97Cu)

/** \brief 80, Port 25 Output Modification Clear Register 0 */
#define P25_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003B980u)

/** \brief 84, Port 25 Output Modification Clear Register 4 */
#define P25_OMCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR4*)0xF003B984u)

/** \brief 88, Port 25 Output Modification Clear Register 8 */
#define P25_OMCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR8*)0xF003B988u)

/** \brief 8C, Port 25 Output Modification Clear Register 12 */
#define P25_OMCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR12*)0xF003B98Cu)

/** \brief 90, Port 25 Output Modification Set Register */
#define P25_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003B990u)

/** \brief 94, Port 25 Output Modification Clear Register */
#define P25_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003B994u)

