Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxPort_reg.h
/** \brief 64, Port 40 Pin Controller Select Register */
#define P40_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003C864u)

/** \brief 70, Port 40 Output Modification Set Register 0 */
#define P40_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003C870u)

/** \brief 74, Port 40 Output Modification Set Register 4 */
#define P40_OMSR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR4*)0xF003C874u)

/** \brief 78, Port 40 Output Modification Set Register 8 */
#define P40_OMSR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR8*)0xF003C878u)

/** \brief 7C, Port 40 Output Modification Set Register 12 */
#define P40_OMSR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR12*)0xF003C87Cu)

/** \brief 80, Port 40 Output Modification Clear Register 0 */
#define P40_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003C880u)

/** \brief 84, Port 40 Output Modification Clear Register 4 */
#define P40_OMCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR4*)0xF003C884u)

/** \brief 88, Port 40 Output Modification Clear Register 8 */
#define P40_OMCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR8*)0xF003C888u)

/** \brief 8C, Port 40 Output Modification Clear Register 12 */
#define P40_OMCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR12*)0xF003C88Cu)

/** \brief 90, Port 40 Output Modification Set Register */
#define P40_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003C890u)

/** \brief 94, Port 40 Output Modification Clear Register */
#define P40_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003C894u)

/** \brief F8, Port 40 Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C8F8u)

/** \brief FC, Port 40 Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C8FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P41
 * \{  */
/** \brief 0, Port 41 Output Register */
#define P41_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003C900u)

/** \brief 4, Port 41 Output Modification Register */
#define P41_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003C904u)

/** \brief 8, Port 41 Identification Register */
#define P41_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003C908u)

/** \brief 10, Port 41 Input/Output Control Register 0 */
#define P41_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003C910u)

/** \brief 14, Port 41 Input/Output Control Register 4 */
#define P41_IOCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR4*)0xF003C914u)

/** \brief 18, Port 41 Input/Output Control Register 8 */
#define P41_IOCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR8*)0xF003C918u)

/** \brief 24, Port 41 Input Register */
#define P41_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003C924u)

/** \brief 40, Port 41 Pad Driver Mode Register 0 */
#define P41_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003C940u)

/** \brief 44, Port 41 Pad Driver Mode Register 1 */
#define P41_PDR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR1*)0xF003C944u)

/** \brief 50, Port 41 Emergency Stop Register */
#define P41_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003C950u)

/** \brief 60, Port 41 Pin Function Decision Control Register */
#define P41_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003C960u)

/** \brief 64, Port 41 Pin Controller Select Register */
#define P41_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003C964u)

/** \brief 70, Port 41 Output Modification Set Register 0 */
#define P41_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003C970u)

/** \brief 74, Port 41 Output Modification Set Register 4 */
#define P41_OMSR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR4*)0xF003C974u)

/** \brief 78, Port 41 Output Modification Set Register 8 */
#define P41_OMSR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR8*)0xF003C978u)

/** \brief 80, Port 41 Output Modification Clear Register 0 */
#define P41_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003C980u)

/** \brief 84, Port 41 Output Modification Clear Register 4 */
#define P41_OMCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR4*)0xF003C984u)

/** \brief 88, Port 41 Output Modification Clear Register 8 */
#define P41_OMCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR8*)0xF003C988u)

/** \brief 90, Port 41 Output Modification Set Register */
#define P41_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003C990u)

/** \brief 94, Port 41 Output Modification Clear Register */
#define P41_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003C994u)

/** \brief F8, Port 41 Access Enable Register 1 */
#define P41_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C9F8u)

/** \brief FC, Port 41 Access Enable Register 0 */
#define P41_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C9FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPORT_REG_H */
